{"pages":[{"title":"お探しのページは見つかりませんでした。","text":"","link":"/cats-cats-cats/404.html"},{"title":"about","text":"hinastoryのブログです。興味のある技術を中心に記録していきます。 本ブログの著作権は、引用元が他所と分かる文章と画像を除いて、hinastoryが保持しています。本ブログ内のhinastoryが著作権を有する記事と画像(cats cats catのロゴ画像を除く)はCC BY 4.0()で公開されています。 cats cats catsのロゴ画像は本ブログのシンボルですので、本ブログを引用元として明示したい場合にご利用できます。それ以外の用途での利用はご遠慮ください。 本ブログに関するお問い合わせは以下へのメールでお願いします。","link":"/cats-cats-cats/about/index.html"}],"posts":[{"title":"Hexoでブログに再入門","text":"Advent Calendar用に久々にブログを立てて見ました。以前にパブリックに書いたのは多分10年以上前のような気がします。レンタルーサーバ借りてドメイン取ってRubyで動く何かを使って立てた気がするけど、よく思い出せません・・・ まぁ、過去のことは置いておいてせっかく立てたので、何か役立ちそうなことをメモしていきたいと思います。 目次1. Hexoとは2. 静的サイトジェネレータ3. 静的サイトジェネレータの長所4. 静的サイトジェネレータの短所5. なぜHexoを選んだのか？6. まとめ7. 補足 1. Hexoとはとりあえず今回このブログは、Hexo使って立ててみました1。Hexoはブログを書くためのフレームワークですが、WordPressのような従来型のブログサービスとの一番の違いは、静的にブログを生成するか、動的に生成するかです。 2. 静的サイトジェネレータHexoは静的サイトジェネレータというツールに分類されていて、あらかじめ用意したブログのテキストや画像等から、ブログの表示に必要なHTML,CSS,JavaScriptなどの静的ファイルを生成してくれます。Hexoがやってくれるのはここまでで、あとはHexoが生成したファイルをお好みのWebサーバに公開すればブログが表示されると言う仕組みです。WordPressはこれとは違い、Webにアクセスが来るごとにWebページをサーバサイドのプログラムが動的に生成してブラウザに返しています。 3. 静的サイトジェネレータの長所どちらにも一長一短があって、静的サイトジェネレータの良いところはローカルで確認してから、チェックが完了してからWeb公開できる点です。このローカルで確認できると言うのはすごい強みで、画像のアップロードも不要だし、テキストやCSSの修正も手元で直してすぐ確認できると言うのが非常に心地いいです。これが動的サイトだと一度サーバにアップロードして確認と言う手間が一つ入るため、色々と面倒臭くなります。 また、静的サイトジェネレータの場合、サイトの生成に必要なファイルは必然的に手元で管理することになるので、Gitなどのバージョン管理システムと相性が良いです。これは非常に安心感があって、こまめにコミットしておけば様々な理由による『ブログの消失』を未然に防ぐことができます。動的サイトの場合も手元にファイル等の形で残しておけば、バージョン管理することができますが、ちょこっとした修正をサーバにアップロードして、バージョン管理用ファイルに反映し忘れるという事故が起き易いです。 セキュリティ的に安心というのも魅力の一つですね。サーバサイドの処理がないので攻撃パターンが限られますし、特にWebサーバにホスティングサービスを使っている場合、自分ではほぼ何もセキュリティについて考えることはないです。少ない懸念点の一つとしてあげるならばJavaScriptを使ってる場合です。まぁ最近は大抵知らずのうちに使われてると思いますが、特に怪しいライブラリを使っている場合に勝手にマイニングされたり、踏み台にされる場合もあるので、気をつけた方が良いかもしれません2。 4. 静的サイトジェネレータの短所このようにHexoのような静的サイトジェネレータ型のブログツールには利点がたくさんあるのですが、もちろん欠点もあります。一番目立つのは、非エンジニアにとって利用するのにハードルが高いということです。例えば、Hexoのトップページには「Simple」と謳いながら、以下の導入時のコマンドが載っています。\u0010\u0010\u001012345$ npm install hexo-cli -g$ hexo init blog$ cd blog$ npm install$ hexo server これを見て「簡単そうだな、やってみようかな」と思える人は世の中に1%もいないと思います。もちろん現役のWebフロントエンドエンジニアなら、これを見てお湯を注いだカップラーメンができるより早くブログサイトを構築できるでしょう3。つまり、現在のところ静的サイトジェネレータはGitが分かるフロントエンドエンジニアにとって、非常に使い易いツールだけど、それ以外の人は、まぁ覚悟して取り組んでくださいとしか言いようがないですね。。。もちろん将来的にはシンプル詐欺などではなく本当に非エンジニアでも無理なく使えるツールが出てくるかもしれないので、この点は静的サイトジェネレータ固有の短所というよりもまだ成熟途中の技術の特徴ということになります。 あと当然ですが、静的サイトジェネレータ単体ではサーバサイドという概念がないのでRDBと連携して、大量データの検索とかテーブルの結合とかそういった処理も基本できません。カウンタやトラックバックやコメント機能などのブログにおなじみの機能もデフォルトではありません。このような場合はWebサービスと連携するのが常套手段ですが4、複雑になりそうなら最初から動的サイトやSPAやSSR等の構成5を検討した方が良いでしょう。逆に考えると静的サイトジェネレータの一番の使い道はこのような処理が基本的に不要な場合のプライベートなブログで、まさにHexoはこのサイトにうってつけなのでしょう。 5. なぜHexoを選んだのか？まさしく、前掲のコマンドを見て簡単そうに思えたからです(笑)。つまりそれをコピペして実行するだけで試せる環境と知識をすでに有していたからということになります。あとはHexoと言うより静的ジェネレータの利点の方が大きいですね。最初はVPSやパブリッククラウド上に、以前のように動的サイトを構築しようと考えていましたが、構築コストやセキュリティのことを考えるとだんだん気が重くなってきました。ブログサービスも検討しましたが、ソースは全てGit管理したかったのと手元で表示確認がすぐにできないので却下しました。つまりGit管理と親和性があって手元ですぐにサイトの表示が確認できて、セキュリティーの心配をあまり心配しなくてもいい記事投稿が簡単にできるブログツールを探していたということになります。その中で一番最初に目に付いたのがHexoだったというだけです。記事がMarkdownでかけるのもいいですね。なのでもっといいツールが見つかれば移行するかもしれませんが、しばらくはHexoと仲良くやって行こうと思っています。目下の悩みはテーマをどうするかです。デフォルトのlandscapeも拡張しやすくて悪くはなかったのですが、せっかくこれだけのテーマが公開されているので色々と試したいと思っています。6。 6. まとめまとめです。Hexoの箇所は静的サイトジェネレータに置き換えても大体合ってます。３行を目指しましたが、なかなか難しいですね。 Hexoは静的サイトジェネレータ型のブログツール Hexoはローカルで編集して、すぐに実際の表示が確認ができるので、心地よい Hexoはバージョン管理と相性が良く、こまめにコミットで安心できる Hexoはセキュリティ的に動的サイトに比べて安心 Hexoは非エンジニアに基本向かない Hexoではカウンタやコメント機能等、サーバサイドの処理が必要なものは基本使えない 7. 補足前述の通りでHexoを最初に選んだのは私にとって簡単そうに見えたからです。だけどそう見えたのは私の好みや経験という色眼鏡があったからなので、申し訳ないですがこのブログを読んでくれた方に当てはまるかどうかは分かりません。もちろん世の中にはHexo以外にも山のように静的サイトジェネレータがあるので、余力のある人にはぜひ以下のサイトを参考に自分にあった運命の静的サイトジェネレータを探し出して欲しいです。。。7 StaticGenStaticGen is a leaderboard of the top open source static site generators. Promoting a static approach to building websites. 1.Hexoは「ヘキソ」と発音しています。正しいかどうかは分かりません。 ↩2.つい先日もnpmパッケージの「flatmap-stream」に仮想通貨を盗み出すコードが混入していて話題になりました。近年JavaScriptのセキュリティインシデントは増加傾向にあるので楽観視はできません。 ↩3.テーマを弄りはじめるとエンジニアでも頭を抱えそうですが・・・ ↩4.例えばコメント機能はDisqusと連携すれば実現できます。 ↩5.SPA = Single Page Application, SSR = Server Side Rendering ↩6.現在このブログで利用しているテーマはフッターを参照してください。テーマは今後変わる予定があるのであえて本文には記しません。 ↩7.願わくばこの記事を読んだ人が静的サイトジェネレータの旅に出て、ブログを書いてくれてそれが、私の目に止まりますように・・・ ↩","link":"/cats-cats-cats/2018/12/02/start-blog-hexo/"},{"title":"気が付いたら本棚がキーボード棚に変わっていた話","text":"この記事は自作キーボード #2 Advent Calendar 2018 12日目の記事です。自分はゆるふわでキーボードを楽しみたい勢なので、カジュアルにキーボードを楽しむ方法について書いてみたいと思います。ガチなモノ作りの記事はすでに多くの人が書かれていると思うので、その途中で箸休め的に読んでいただけると幸いです。 自作キーボード #2 Advent Calendar 2018 - Adventar書きたいのに枠がないという方のための2枚目です。 [その1](https://adventar.org/calendars/2954) [その3](https://adventar.org/calendars/3208) 「皆さん、EndGameしていますか？」 日本の自作… 目次1. 自作キーボード以前2. 自作キーボードに興味を持つ3. 発狂する4. 自作キーボードの門を叩く5. キーボード棚の作り方6. デコキーのすすめ7. 最後に 1. 自作キーボード以前キーボードにこだわりを持ち始めたのはコンパクトなキーボードを探し始めてからでした。もう15年以上昔の話ですが、その時出会ったのがぷらっとホームが販売していた以下のFKB8579です。 気持ち良い打鍵感で10年以上愛用していました。右側の画像はキートップを外したところですが、キースイッチはメンブレンシートです。最近はCherry MX互換やロープロのスイッチしか触っていなかったのでこういうのを見るとほっこりします。大切に使ってきたのでまだ使えますが、さすがに引退させてあげたいと思ったので次に飛びついたのがARCHISSのProgresTouch RETRO TINYです。メカニカルキーボードでコンパクトなタイプを探していたらちょうどこのキーボードが発売直後だったので購入しました1。 2. 自作キーボードに興味を持つProgresTouch RETRO TINYは打ち心地がよく気に入っていたのです、去年あたりから自作キーボードが盛り上がっていると言う噂を聞くようになりました。ただ、はんだ付けが面倒そうだったので様子見していましたが、キー配置のカスタマイズが自由にできるとういうのはやってみたいと思っていました。 しかしその瞬間は唐突に訪れました。去年の11月ごろMassdropからPlanck Lightが買えるという情報が流れてきたのです。もちろんこのときMassdropもPlanckキーボードのことも欠片も知りませんでしたが、以下の動画を見て一発でやられてしまいました。 やっぱり光るのずるいですね（笑）。あと完成品も販売してくれるとのことだったので、懸念だったはんだ付けも必要がないことも大きかったです。これで念願のキー配置を自由にいじれるということで即座にDropに参加しました。ただこれが過ちの第一歩だとは知らずに・・・発送予定は2018/5/18となっていて、このときまだ半年先だったので気長に待つことにしました・・・待つことにしたのですが、Massdropのやつは毎日のようにダイレクトメールを送りつけてきます。無視すればいいだけのことなのですが、ときどき GMK Red Samurai のような耐え難い誘惑があり、Dropに参加させられました・・・ 3. 発狂する5月初旬にMassdropから一通のメールが来ました。PCBの生産でトラブっていて発送が7月初旬になるということでした。楽しみにしていただけに落ち込みましたが、既に半年近く待っていたのであまり気にしない方向で精神を落ち着けました。ちなみにこのときはまだ自分がはんだ付けをすることになるとはまだ考えていませんでした。このときまでにQMK firmwareが動作する完成品を販売している場面を何回か見ていたのでこれが気に入らなかったら別のを買えばいいと考えていたからです。時が流れて6月に入り大分そわそわしてきたので、GitHubからQMK firmwareのリポジトリをフォークしてキーマップをいじり始めました。このキーマップを考えている瞬間は最高に幸せでした。。。 そしてとうとう7月に入り我が家にPlanck Lightがやってきました。Macにつないで打ってみて動作は問題なさそうでした。そして色々と光らせてこのときは大分テンションが上がりました。そして念願のQMK firmwareを書き込むときが来ました。しかし、不思議なことにfirmwareが書き込まれてくれないのです。何回も試しました。何回も、何回も・・・困り果ててMassdropのDiscussionを覗いて見ると、なんとブートローダを書き込むのを忘れたからキー配置をいじれないという旨が公式からアナウンスされていました・・・ 発狂しました 4. 自作キーボードの門を叩く選択肢はいくつかありました。幸いというか当然というか公式はISPフラッシャーを設計して送ると言っていました。しかしながらこのときは完全に疑心暗鬼になっていて楽観的に待つ気にはなれませんでした。実際に公式の対応は非道いもので、一週間何の音沙汰もないこともしばしばで毎週Discussionで誰かが進捗を尋ねていましたが無応答がほとんどで、罵声が飛ぶような殺伐としてた雰囲気でした2。２つ目の選択肢は自力でブートローダを書き込むことです。一応成功した人もいるようなので試してみる価値はありましたが3、いきなり壊したら立ち直れそうになかったので、諦めて今まで避けてきた第三の選択肢を取ることにしました。 ここに来てようやく自作キーボードの門を叩く決心をしました。本当に長くなってすいません・・・決心したら行動は早かったです。 Ergo42 を注文して4、秋葉原のマルツではんだごてやテスター等必要な道具を揃えて、届いたらすぐに組み立てはじめました。しかし結局動かなかったのでDiscordの自作キーボードのサーバーの初心者チャンネルで色々な人に助けてもらいながら何とか動作させることができました。このときの感動は何とも言い難いですね。あのとき善意で助けいて頂いた方々には本当に感謝しています。そして辛かったけど本当に乗り越えられてよかったです。 この後は数字キーが欲しくなってIrisに手をだしました。 上のキーボードがIrisで下のキーボードがErgo42です。両方共46キーだったのでこの写真は「46キー姉妹」というタイトルでDiscordに投稿しました。しかし何というかあれだけ欲しかった数字キーも慣れてくるといらなくなりました・・・結局手首をなるべくリストレストに固定して打つようになるため指が届きにくいキーは不要みたいな感じになりました。 このあとに作ったのはMint60です。Maker Faire Tokyoで買い損ねたので、コミケに始発で乗り込んでゲットしてきました。 オシャカワなキーボードが手に入ってとても嬉しかったのですが、残念ながらこの頃には指がOrtholinearに慣れてしまっていて、Row-StaggerdなMint60は既に打ちづらくなっていました・・・もう少し出会いが早ければ最高の相棒になったかもしれませんが、現在は布教担当として働いてもらっています。 だいたいここまでが自作キーボードを作り始めて1ヶ月くらいですが、一気にモノを増やしすぎたため置き場所に困るようになってきました。もちろんただ積み重ねるだけならできるのですが、キーキャップやスイッチ等は探しやすく見比べやすいようにしたい欲求が高まってきたのでキーボード棚を作ることにしました。 5. キーボード棚の作り方まずは本棚をご用意ください(笑)。いきなり落ちからはじめて申し訳ございません。実際に自分のキーボード棚は本棚の流用なのでこれ以上何も言うことはないのですが問題が一つありまして、もともとこの本棚には捨てられない本5がぎっしり詰まっていたのです。そこでひたすら 自炊を頑張りました。 一気に100冊程自炊したので大分消耗しました。上の写真は自炊道具で、どこのご家庭にもあると思わるごく普通の裁断機とスキャナです6 。ブログ先頭の写真は自作キーボードをはじめて2ヶ月経った頃の写真でキーボード棚を作った当初の写真です。現在は以下のようになっています。 下から2段目は道具を置いています。道具は他にもあるのですが収まりが悪いハンダゴテや腕を増やすツールとかを置いています。一番下の棚は非常に心苦しいのですがいわゆる積みキーボードというものです。今年中に何とか進捗を出そうと思っています。最初は実用重視で作ったキーボード棚ですが、実際に作ってみるとショーケースみたいな感じで毎日眺めていて楽しいので、キーボードの楽しみ方が一つ増えました。これはおすすめです。ちなみに本棚はあと6台あるので徐々にキーボード棚に変えて行こうと思っています。 6. デコキーのすすめこの記事の冒頭でカジュアルにキーボードを楽しむ方法について書きたいと述べましたが、その一つがデコキーです。デコキーとは「デコレーションされたキーボード」の略で、ここではシールや紙・布等を両面テープとでキーボードに貼り付けて飾ることを指しています。メイクと同じで盛りキーボードと言ってもよいかもしれません。 EndGameという言葉をよく耳にしますが、実際に打ち心地やキー配置はEndGameに近づけられても見た目は必ず飽きがくると思われます。もちろん際限なくキーキャップを変えたり、キーキャップやケーブルやケースやPCB等を自作できる時間と金銭と能力に余裕がある人はいいのですが、世の中の大半の人はそうでないと思われます。そこでデコキーでカジュアルにキーボードの見た目を変えてみようというのがここでの提案です。もちろんこのデコキーがしやすいキーボードには前提があってシールを貼る余白が必要です。現在の自作キーボードキットにはデコキーに必要な余白を持つものが非常に少ないのですが、Ergo42はその中では珍しくデコキーと相性が良いと思われます。 Ergo42の上部の台形部分にシールを貼るだけで印象はガラッと変わります。この写真では木目調のシールを貼っていますが。この手のシールや紙・布は100均で安く手に入り種類も豊富です。自分もちょっとした気分転換にキーキャップに合わせて気軽に盛り直していますが、簡単な割には満足度は高いです。 上のキーボードはRed Samuraiのキーキャップに合わせて台形部分と巻取り式ケーブルに畳縁を貼っており、ケース側面に畳シールを貼っています。一つ注意点を上げるとすればErgo42にデフォルトで付属しているのは鍋ネジなので、そのままだとシールが浮いてしまうので皿ネジに変える必要があります。また皿ネジにしてもそのままだとまだ少し浮くので適当なドリルでネジが平らになるようにアクリル板を少し凹ませる必要があります。 7. 最後に長々と書いてしまいましたが、自作キーボードの世界に飛び込んで後悔はしていません。最初は面倒だったり怖かったりしたものですが、すぐに助けてくれる気の良いコミュニティがあるので、余計な心配をせずにまずは手を動かしてみることが重要だと気づきました。そして新しく開けた扉の先には、モノを作る楽しさと感動がダイレクトに待っています。何より普段何気なく使っているキーボードに対して理解が増し、不便も解消され、愛着も得られると思います。ただ無理をしすぎると反動が来るので、自分にあったペースで自分にあった楽しみ方を見つけて行きたいという思いでこの記事を書きました。この記事がキーボードをカジュアルに楽しみたい方や自作キーボードに興味があるけどまだ手を出せていない方の一助になれば幸いです。 おいでよ、自作キーボードの世界へ この記事はErgo42 with DSA COFFEE HOUSE\" KEYSET &amp; Cherry MX Redで書きました。1.軸は悩みましたがまずは無難に赤軸にしました。 ↩2.結局ISPフラッシャーはさらに2ヶ月も経って、諦めかけた頃に送られてきましが、firmwareの書き込みは無事成功しました。 ↩3.Quick and dirty guide to flashing your Planck Light bootloader ↩4.現在は後継のErgo42 Towelが販売されています。 ↩5.決して怪しい本ではないです。 ↩6.スキャナはScanSnap S1500Mです。 ↩","link":"/cats-cats-cats/2018/12/12/keyboard/"},{"title":"JapanContainerDays v18.12 に初参加","text":"12/4(火)にJapanContainerDays v18.12に初参加しました。このイベントは春に1回目を開催して今回で2回目の開催だそうですが1、会場には800人以上の人が詰め掛けたようで非常に盛況でした。 JapanContainerDays v18.12[12/3-5開催]コンテナ活用/クラウドネイティブの現状をひとまとめにした開発者のためのイベント - JapanContainerDays 目次1. 会場の様子2. キーノート3. 参加セッション一覧3.1. 24日参加セッション3.2. 25日参加セッション4. 食事5. 戦利品6. 感想とまとめ 1. 会場の様子会場は御茶ノ水のソラシティカンファレンスセンターでした。ここには以前にデブサミ夏や大江戸Ruby会議06に参加した時に来たことがあったので特に迷うことなく到着しました2。9:40開始だったのですが念の為30分早く会場入りしたのでキーノートの会場はまだ半分近く空いていました。 撮影：JapanContainerDays実行委員会引用元 撮影：JapanContainerDays実行委員会引用元 2. キーノートさすがにキーノート開始直前には満席近くになっていました。キーノートは会社やコミュニティの代表が順番に登壇する形式で2時間行われました。その中でなんといっても目玉はCNCFのCOOであるChris Aniszczykさんの発表だと思います。 撮影：JapanContainerDays実行委員会引用元 CNCFの歩みや今後の展望が語られていました。気になったのはIoTやEdgeにもKubernetesが進出するという話題でしょうか。KubeEdgeには注目していきたいと思います。あとはどんどんServerlessやNodelessに進んでいく方向性が強調されていました。virtual-kubeletの紹介もあり今後が非常に楽しみです。 kubeedge/kubeedgeKubernetes Native Edge Computing Management Framework - kubeedge/kubeedge virtual-kubelet/virtual-kubeletVirtual Kubelet is an open source Kubernetes kubelet implementation. - virtual-kubelet/virtual-kubelet あと、クラウドネイティブの定義も紹介されていました。今までクラウドネィティブとは何ぞやと思っていたので少しはもやもやが晴れたような気がします。 クラウドネイティブテクノロジは、パブリック、プライベート、およびハイブリッドクラウドなどの最新のダイナミックな環境でスケーラブルなアプリケーションを構築および実行するための組織の能力を強化します。コンテナ、サービスメッシュ、マイクロサービス、不変インフラストラクチャ、および宣言型APIは、このアプローチの例です。 これらの技術は、復元力があり、管理しやすく、観測可能な疎結合システムを可能にします。堅牢な自動化と組み合わせることで、エンジニアは頻繁に、そして予想通りに影響の少ない変更を最小限の労力で行うことができます。 クラウドネイティブコンピューティング基盤は、ベンダーに依存しないオープンソースのプロジェクトのエコシステムを促進し維持することによって、このパラダイムの採用を推進しようとしています。最先端のパターンを民主化し、これらのイノベーションを誰もが利用できるようにします。 クラウドネイティブの定義(Google翻訳を利用)引用元 あとはCNNFの歩き方や全体像も紹介されていました。 CNCF Cloud Native Interactive LandscapeFilter and sort hundreds of cloud native projects and products, and review details including GitHub stars, funding or market cap, first and … Trail MapはともかくLandscapeは圧巻ですね・・・ まぁその中でもCNNFが直接ホスティングしているのはごく僅かです。これを見ると全部で30程ありますが、現時点では成熟度が最高のGraduatedになっているのはKubernetes、Prometheus、Envoyのわずか３つです3。これからクラウドネイティブが浸透していく中でこれらのプロジェクトがどの様になっていくのか注視していきたいと思います。 キーノートには他にも面白い発表がいくつもあったのですが、印象に残ったのはメルカリの発表でした。なぜコンテナオーケストレーションにKubernetesなのかという問いに対して拡張性とエコシステムを挙げていましたが、これと同じ答えはこの後に続くセッションでも繰り返し聞くことになりました。そしてこの答えがOSSで勝ち抜くための到達点なんだという気がしました。シンプルで直交的で整合性のとれた拡張性で素早くエコシステムを構築すること。言葉にすると短いですがこの状況をわずか数年で作り上げて決着までほぼつけてしまうとは、改めてKubernetesの成し遂げたことの凄さを実感しました。 撮影：JapanContainerDays実行委員会引用元 3. 参加セッション一覧とりあえず参加セッションを列挙してみます。メモったキーワードを記載していますが、あやふやな部分も多く含むためさらっと流していただけると幸いです。 3.1. 24日参加セッション keynote CNCF Microservices on Kubernetes at Mercari（Mercari） Kubernetesによる機械学習基盤への挑戦（Preferred Networks） LINEエンジニアを支えるCaaS基盤の今とこれから（LINE） Cloud Nativeの未来とIBMの取組み （IBM） クラウドネイティブで作る、新しいクルマの世界（デンソー） ZOZOTOWNシステムリプレイスにおけるKubernetes活用（ZOZOテクノロジーズ） コンテナネットワーキング（CNI）最前線 コンテナネットワーキングは闇が深い、動きが早い、スケーラビリティに注意 Kubernetes ネットワーキングのすべて Services, Ingress, NetworkPolicy 40 topic of Kubernetes in 40 minutes serviceでなくingressを使え、latestタグは使うな、DockerHubのイメージは信用するな、バージョンアップは容易にするな、ボリュームは使うな、全機能を使う必要はない、ingressはGAではない Ansible、Terraform、Packerで作るSelf-Hosted Kubernetes Kubernetesから始めるクラウドネイティブエンジニアへの道 〜 Kubernetesトレーニングと、CKA/CKAD資格取得に向けて 〜 構築ツールを使わずにやってみた(kubernetes the hard way)、k8sはCloud Nativeにおいてはスターティングポイント 2019年はコンテナよりもクラウドネイティブ!? Knativeのすべて コンテナ辛い！そこでknative, カナリアリリースが楽、riffもあるよ After Party &amp; Booth Crawl !! 3.2. 25日参加セッション 2020年のコンテナはどうなる!? コンテナプラットフォームのこれまでとこれから マイクロサービスは組織論に行き着くので難しい k8sは拡張性の高いOSようなもの K8sは開発やPOCまではうまくいくが本番運用に課題あり istioがここまでくると思っていなかった。サービスメッシュはエンタープライズにこそ必要 cloudfoudry,istio,mesoss,open shift,rancher,rio, core os,kubeflow, knative マイクロサービスの高可用性：Ingress, サービスメッシュの世界におけるロードバランシング nginx社は実在する plusもあるよ 複雑になったWebを簡素化したい fablic modelではすべてのappにサイドカーとしてnginxが入る Dockerセキュリティ: 今すぐ役に立つテクニックから，次世代技術まで 鍵をイメージに入れるな、--ssh,--seacretを使え。使えない場合はスカッシュやマルチステージというワークアラウンドを使え イメージスキャナ - clair, aqua microscanner 誤検知もあるので信用しすぎるな dockerソケットに気をつけろ。dockerグループに入れるのは危険 コンテナ is namespace + capabilities + cgroups SELinux無効化するときは「石川さん、Walshさんごめんなさい 」と唱えてから実行 Kubernetesと暮らすRancherな生活 rancherはk8sのオーケストレーション層ではなくその上のストラテジー層 2.0でk8s一本になり、Pure Goになり、マネージドもOKになりカタログがHelmになった rioはおもしろそうだがまだかなり柔らかい。k8sを意識しない時代に・・・ MeetUpを活性化せよ！最強のリアルタイムQA投稿アプリをCloud_Nativeにつくってみた - Qicoo - 自演が可能です - eks,ec2,elastic cache, rds,cloud flront, route 53,cert manager, elb, travis ci, kustomize, hepioak, spinnaker,kanyeta,prometheousOperator, Halyard - Cloud Native Developers JP - Cloudcraft – Draw AWS diagrams コンテナ時代のOpenStack Kubernetes Meetup Tokyo 2年間の振り返りと未来 参加者の規模数がすごい 登壇者限定で濃い話をする会がある 登壇してください 自分が参加したセッション以外は以下にまとめがあるのであとで読みたいと思います。 JapanContainerDays v18.12 matome – JapanContainerDays Team – MediumJapanContainerDays v18.12 公式資料まとめ 4. 食事昼食はランチセッション中に配布されたサンドイッチやまい泉ヒレかつサンドを食しました。 撮影：JapanContainerDays実行委員会引用元 お菓子やドリンクも無料で楽しむ事ができました4。ContinerDaysのロゴが入ったマカロンが可愛かったです。 撮影：JapanContainerDays実行委員会引用元 After Partyではビールやワインや焼酎をの呑みながらワイガヤしてました。急遽決まったLT大会では個性あふれる様々な会社がHiringトークをしていました。 撮影：JapanContainerDays実行委員会引用元 5. 戦利品勢い余って電子書籍3冊も買ってしまいました。面白かったのはNGINXで配られたUSBケーブルです。正直そのタコ足のような発想はありませんでした(笑) 6. 感想とまとめ参加したことでCloudNativeがどこまできているか肌で実感できた気がしました。自宅ではminikubeからGPUを触れる環境を構築していますが、いまいち有効利用できていない気がしていたので、このイベントを機会に手を動かしながらいろいろとCloudNativeに近づけて見たいと思います。 Kubernetesの一人勝ち 今後はKubernetesのエコシステムの何処を占めるかの戦い サービスメッシュ(Istio)がかなり熱い Helmもデファクトになりそう knative, virtual-kubeは注視したい 機械学習のインフラとしても面白そう Kubernetesは本番運用に課題あり knative, OpenShift, Rancher等さまざまなアプローチで解決しようとしている 最終的にはNoOpsやサーバーレスやFaaSな未来に行き着くのだろう・・・（時期未定） 来年はCloudNative Days1.JapanContainerDaysは2回目にして、今回で最終回だそうです。次回からはCloudNative Daysに変わるそうですがCloud Native Days Tokyoとの関係性はよくわかりません・・・ ↩2.駅から徒歩1分なので、そもそも迷うほうが難しい気もします・・・ ↩3.というかPrometheusはCNNFだったとは初めて知りました・・・ ↩4.当日は本当に無料だと喜んだのですが、冷静に考えると参加費を払っているので無料でもなんでもなかったです・・・ しかし、チケットは最後までEarly Bird価格のまま安売りされていたけど主催者の想定した人数が集まらなかったから値下げしたのか、それとも早めに予定金額を調達できたから値下げしたのか真相がわからない・・・どちらにせよ焦ってEirly Birdに釣られた身としてはもやもやします・・・ ↩","link":"/cats-cats-cats/2018/12/06/container-days/"}],"tags":[{"name":"Hexo","slug":"Hexo","link":"/cats-cats-cats/tags/Hexo/"},{"name":"Web","slug":"Web","link":"/cats-cats-cats/tags/Web/"},{"name":"Keyboard","slug":"Keyboard","link":"/cats-cats-cats/tags/Keyboard/"},{"name":"AdventCalendar","slug":"AdventCalendar","link":"/cats-cats-cats/tags/AdventCalendar/"},{"name":"Container","slug":"Container","link":"/cats-cats-cats/tags/Container/"},{"name":"k8s","slug":"k8s","link":"/cats-cats-cats/tags/k8s/"}],"categories":[{"name":"Tech","slug":"Tech","link":"/cats-cats-cats/categories/Tech/"},{"name":"DIY","slug":"DIY","link":"/cats-cats-cats/categories/DIY/"},{"name":"Web","slug":"Tech/Web","link":"/cats-cats-cats/categories/Tech/Web/"},{"name":"Keyboard","slug":"DIY/Keyboard","link":"/cats-cats-cats/categories/DIY/Keyboard/"},{"name":"Container","slug":"Tech/Container","link":"/cats-cats-cats/categories/Tech/Container/"}]}